results/factorial-final/security-overhead-final-tls-broker3/security-overhead-final-factorial-tls-b3-rf3-isr3-msg10240-tps10000-batch131072-acksall-prod6-compnone-trial2/producer-perf.log
run_id=security-overhead-final-factorial-tls-b3-rf3-isr3-msg10240-tps10000-batch131072-acksall-prod6-compnone-trial2
producer_count=6
----- /var/lib/kafka-client/results/security-overhead-final-factorial-tls-b3-rf3-isr3-msg10240-tps10000-batch131072-acksall-prod6-compnone-trial2/producer-perf-1.log -----
producer_index=1
producer_count=6
producer_records=16667
producer_throughput=1667
1 records sent, 0.1 records/sec (0.00 MB/sec), 7139.0 ms avg latency, 7139.0 ms max latency.
1104 records sent, 218.4 records/sec (2.13 MB/sec), 3492.6 ms avg latency, 4948.0 ms max latency.
3648 records sent, 717.0 records/sec (7.00 MB/sec), 4808.2 ms avg latency, 6183.0 ms max latency.
6648 records sent, 1327.5 records/sec (12.96 MB/sec), 2908.2 ms avg latency, 4564.0 ms max latency.
16667 records sent, 667.694896 records/sec (6.52 MB/sec), 2752.25 ms avg latency, 7139.00 ms max latency, 2593 ms 50th, 5171 ms 95th, 5600 ms 99th, 6101 ms 99.9th.
----- /var/lib/kafka-client/results/security-overhead-final-factorial-tls-b3-rf3-isr3-msg10240-tps10000-batch131072-acksall-prod6-compnone-trial2/producer-perf-2.log -----
producer_index=2
producer_count=6
producer_records=16667
producer_throughput=1667
1 records sent, 0.1 records/sec (0.00 MB/sec), 2050.0 ms avg latency, 2050.0 ms max latency.
1536 records sent, 300.4 records/sec (2.93 MB/sec), 3837.8 ms avg latency, 8237.0 ms max latency.
3312 records sent, 656.0 records/sec (6.41 MB/sec), 5577.9 ms avg latency, 6553.0 ms max latency.
3744 records sent, 742.7 records/sec (7.25 MB/sec), 4141.6 ms avg latency, 4798.0 ms max latency.
16667 records sent, 611.880025 records/sec (5.98 MB/sec), 3421.30 ms avg latency, 8237.00 ms max latency, 3918 ms 50th, 5984 ms 95th, 6319 ms 99th, 6531 ms 99.9th.
----- /var/lib/kafka-client/results/security-overhead-final-factorial-tls-b3-rf3-isr3-msg10240-tps10000-batch131072-acksall-prod6-compnone-trial2/producer-perf-3.log -----
producer_index=3
producer_count=6
producer_records=16667
producer_throughput=1667
1 records sent, 0.1 records/sec (0.00 MB/sec), 1818.0 ms avg latency, 1818.0 ms max latency.
1632 records sent, 323.4 records/sec (3.16 MB/sec), 3717.1 ms avg latency, 8492.0 ms max latency.
3744 records sent, 736.3 records/sec (7.19 MB/sec), 4739.5 ms avg latency, 6228.0 ms max latency.
3648 records sent, 725.5 records/sec (7.09 MB/sec), 4216.9 ms avg latency, 4747.0 ms max latency.
16667 records sent, 621.624646 records/sec (6.07 MB/sec), 3181.69 ms avg latency, 8492.00 ms max latency, 3940 ms 50th, 5177 ms 95th, 5745 ms 99th, 6126 ms 99.9th.
----- /var/lib/kafka-client/results/security-overhead-final-factorial-tls-b3-rf3-isr3-msg10240-tps10000-batch131072-acksall-prod6-compnone-trial2/producer-perf-4.log -----
producer_index=4
producer_count=6
producer_records=16667
producer_throughput=1667
1 records sent, 0.1 records/sec (0.00 MB/sec), 1258.0 ms avg latency, 1258.0 ms max latency.
1176 records sent, 231.9 records/sec (2.26 MB/sec), 3557.7 ms avg latency, 7442.0 ms max latency.
2856 records sent, 568.4 records/sec (5.55 MB/sec), 5898.5 ms avg latency, 7032.0 ms max latency.
3744 records sent, 743.4 records/sec (7.26 MB/sec), 4365.4 ms avg latency, 6092.0 ms max latency.
16667 records sent, 608.640082 records/sec (5.94 MB/sec), 3386.09 ms avg latency, 7442.00 ms max latency, 3926 ms 50th, 6270 ms 95th, 6725 ms 99th, 6950 ms 99.9th.
----- /var/lib/kafka-client/results/security-overhead-final-factorial-tls-b3-rf3-isr3-msg10240-tps10000-batch131072-acksall-prod6-compnone-trial2/producer-perf-5.log -----
producer_index=5
producer_count=6
producer_records=16666
producer_throughput=1666
1 records sent, 0.1 records/sec (0.00 MB/sec), 7408.0 ms avg latency, 7408.0 ms max latency.
1284 records sent, 252.0 records/sec (2.46 MB/sec), 4165.6 ms avg latency, 5796.0 ms max latency.
4512 records sent, 890.3 records/sec (8.69 MB/sec), 4146.4 ms avg latency, 5940.0 ms max latency.
3744 records sent, 742.1 records/sec (7.25 MB/sec), 3957.5 ms avg latency, 4485.0 ms max latency.
16666 records sent, 618.220936 records/sec (6.04 MB/sec), 3387.65 ms avg latency, 7408.00 ms max latency, 3811 ms 50th, 5003 ms 95th, 5360 ms 99th, 5870 ms 99.9th.
----- /var/lib/kafka-client/results/security-overhead-final-factorial-tls-b3-rf3-isr3-msg10240-tps10000-batch131072-acksall-prod6-compnone-trial2/producer-perf-6.log -----
producer_index=6
producer_count=6
producer_records=16666
producer_throughput=1666
1 records sent, 0.1 records/sec (0.00 MB/sec), 7118.0 ms avg latency, 7118.0 ms max latency.
1020 records sent, 199.8 records/sec (1.95 MB/sec), 3292.4 ms avg latency, 4765.0 ms max latency.
4032 records sent, 799.0 records/sec (7.80 MB/sec), 4303.8 ms avg latency, 5459.0 ms max latency.
5688 records sent, 1135.1 records/sec (11.08 MB/sec), 3341.2 ms avg latency, 4395.0 ms max latency.
16666 records sent, 661.401699 records/sec (6.46 MB/sec), 2763.18 ms avg latency, 7118.00 ms max latency, 3188 ms 50th, 4728 ms 95th, 5167 ms 99th, 5378 ms 99.9th.